"""Есть class Human, характеристиками которого являются:
Имя
Возраст
Наличие денег
Наличие собственного жилья
Человек может:
Предоставить информацию о себе
Заработать деньги
Купить дом

Также же есть class Дом, к свойствам которого относятся:
Площадь
Стоимость
Для Дома можно:
Применить скидку на покупку

Задание:
Реализовать описанную структуру и проверить методы предоставления скидки и приобретения дома. Сгенерировать несколько
экземпляров класса Дом и Human. Далее написать функцию, которая подберет наилучший дом для человека, на основании
площади и кол-ва денег у него на счету, а так же выведет список домов, которые можно рекомендовать. Параметры для
рекомендации можно выбрать любые. Например, если применить скидку стоимость дома будет подходящей, если человек
заработает еще, стоимость так же будет подходящей."""